УТ.РасширениеКонтурЛогистика/src/Catalogs/КонтурЛогистика_Настройки/КонтурЛогистика_Настройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Настройки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Значение</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_КлассификаторУпаковок</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      <types>EnumRef.КонтурЛогистика_ТипыПрокси</types>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
      <types>EnumRef.КонтурЛогистика_ЕдиницыИзмеренияГСМ</types>
      <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
      <types>CatalogRef.КонтурЛогистика_ГорючеСмазочныеМатериалы</types>
      <types>CatalogRef.КонтурЛогистика_Лицензии</types>
      <types>EnumRef.КонтурЛогистика_ТипыТранспортныхСредств</types>
      <types>EnumRef.КонтурЛогистика_ФункцииЗаказаЗаявки</types>
      <types>CatalogRef.Валюты</types>
      <types>EnumRef.КонтурЛогистика_МастерДанныеСотрудников</types>
      <types>CatalogRef.Контрагенты</types>
      <types>EnumRef.КонтурЛогистика_СпособыПередачиМЧД</types>
      <types>Boolean</types>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
      <types>EnumRef.КонтурЛогистика_ВидыПутейСообщений</types>
      <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
      <types>EnumRef.КонтурЛогистика_ВариантыПроверкиПолномочийМЧД</types>
      <types>EnumRef.КонтурЛогистика_ВидыВладенияТранспортнымСредством</types>
      <types>CatalogRef.Организации</types>
      <types>EnumRef.КонтурЛогистика_МетодыОпределенияМассы</types>
      <types>EnumRef.КонтурЛогистика_ТипыПМ</types>
      <types>String</types>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>EnumRef.КонтурЛогистика_РежимыАвторизации</types>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
      <types>CatalogRef.Пользователи</types>
      <types>EnumRef.КонтурЛогистика_СпособыСопоставленияТоваровТитул3</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>CatalogRef.Партнеры</types>
      <types>EnumRef.КонтурЛогистика_СценарииПодписанияТитулов</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>EnumRef.КонтурЛогистика_ВариантыВалидации</types>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.КонтурЛогистика_СостоянияДвиженияДокументооборота</types>
      <types>EnumRef.КонтурЛогистика_ТипыПоказанийТоплива</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
      <types>EnumRef.КонтурЛогистика_ВидыПеревозки</types>
      <types>EnumRef.КонтурЛогистика_ТипыСопроводительныхДокументов</types>
      <types>EnumRef.КонтурЛогистика_ВидыКоммерческихПеревозок</types>
      <types>CatalogRef.ЗоныДоставки</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоДляРасширения</name>
    <comment>В расширениях до 8.3.20 запрещено использовать предопределенные. Будем использовать это поле.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЗначений</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>EnumRef.КонтурЛогистика_ВидыКонтактнойИнформации</types>
        <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
        <types>EnumRef.КонтурЛогистика_ТипыЛиц</types>
        <types>EnumRef.КонтурЛогистика_УровниДоступаСотрудника</types>
        <types>CatalogRef.Валюты</types>
        <types>CatalogRef.Контрагенты</types>
        <types>Boolean</types>
        <types>EnumRef.КонтурЛогистика_ГруппыУпаковки</types>
        <types>EnumRef.КонтурЛогистика_ВидыВладенияТранспортнымСредством</types>
        <types>CatalogRef.Организации</types>
        <types>EnumRef.КонтурЛогистика_МетодыОпределенияМассы</types>
        <types>String</types>
        <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
        <types>CatalogRef.Пользователи</types>
        <types>Date</types>
        <types>Number</types>
        <types>CatalogRef.ТранспортныеСредства</types>
        <types>CatalogRef.Партнеры</types>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>EnumRef.КонтурЛогистика_КлассыОпасностиГрузов</types>
        <types>CatalogRef.Склады</types>
        <types>EnumRef.КонтурЛогистика_ИнициаторыПереадресовки</types>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
        <types>CatalogRef.ЗоныДоставки</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ.РасширениеКонтурЛогистика/src/Enums/КонтурЛогистика_ТипыПМ/КонтурЛогистика_ТипыПМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыПМ</name>
  <enumValues>
    <name>Отключен</name>
  </enumValues>
  <enumValues>
    <name>ВСоставеКонфигурации</name>
  </enumValues>
  <enumValues>
    <name>ФайлНаДиске</name>
  </enumValues>
  <enumValues>
    <name>ВСправочнике</name>
  </enumValues>
</mdclass:Enum>

УТ.РасширениеКонтурЛогистика/src/Catalogs/КонтурЛогистика_Настройки/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураПредопределенных = Новый Структура;

	// поддержим работу в расширении	
	МассивИменПредопределенных = Новый Массив;
	МассивИменПредопределенных.Добавить("СвоиНастройки");
	МассивИменПредопределенных.Добавить("ПодключаемыйМодульПуть");
	МассивИменПредопределенных.Добавить("ПодключаемыйМодульТип");
	МассивИменПредопределенных.Добавить("СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы");
	МассивИменПредопределенных.Добавить("СохранятьАрхивДокументооборотаВКаталог");
	МассивИменПредопределенных.Добавить("КаталогСохраненияАрхиваДокументооборота");
	МассивИменПредопределенных.Добавить("ИспользуютсяМногиеКОдному");
	МассивИменПредопределенных.Добавить("КонтактыАдминистратора_АдресаЭлектронныхПочт");
	МассивИменПредопределенных.Добавить("КонтактыАдминистратора_Телефоны");
	Для Каждого ПредопределенноеИмя Из МассивИменПредопределенных Цикл
		СтруктураПредопределенных.Вставить(ПредопределенноеИмя, 
				Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(ПредопределенноеИмя));
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		
		Объект.Родитель = СтруктураПредопределенных.СвоиНастройки;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(Объект.ТипЗначения) ИЛИ
			(Объект.Наименование = "Путь до файла обработки epf" И
			ПолучитьТипПМ() = Перечисления.КонтурЛогистика_ТипыПМ.ФайлНаДиске) Тогда
			
			Справочники.КонтурЛогистика_Настройки.УстановитьНастройкеЗначениеПоУмолчанию(Объект.Ссылка);
			Прочитать();
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтоПользовательскаяНастройка = Справочники.КонтурЛогистика_Настройки.ЭтоПользовательскаяНастройка(Объект);
	
	УстановитьТипЗначенияЭлементаЗначения();
	
	Если Найти(Объект.ИмяПредопределенногоДляРасширения, "Пароль") <> 0 Тогда
		Элементы.Значение.РежимПароля = Истина;
	КонецЕсли;
	
	Элементы.ГруппаСписокНастройки.Видимость 				= ЭтоПользовательскаяНастройка;
	Элементы.ИмяПредопределенныхДанных.ТолькоПросмотр 		= Не ЭтоПользовательскаяНастройка;
	
	УправлениеОтображениемДляОтдельныхНастроек();
	
	ТекПользовательПродвинутый = (КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор()
		Или РольДоступна("КонтурЛогистика_НастройкаПодсистемы"));
	
	Если Объект.Ссылка = СтруктураПредопределенных.КонтактыАдминистратора_Телефоны
		И Не Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИспользоватьОтправкуВТелеграм") Тогда
		
		Сообщить("Для отправки сообщений необходимо включить настройку: Использовать отправку в Телеграм");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеОтображениемДляОтдельныхНастроек()
	
	Если Объект.Ссылка = СтруктураПредопределенных.КаталогСохраненияАрхиваДокументооборота Тогда
		
		КонтурЛогистика_РаботаСЭлементамиФормыСервер.СоздатьЭлементыФормыДляКаталогаСохраненияАрхиваДокументооборота(ЭтаФорма);
				
	ИначеЕсли Объект.Ссылка = СтруктураПредопределенных.СохранятьАрхивДокументооборотаВКаталог Тогда
		
		// Не важно под какой организацией получаем данные
		ТочноеСовпадение = Ложь;
		ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(,, ТочноеСовпадение);
		Если Не ПараметрыСервиса.АвторизацияВыполнена Тогда
			
			ТекстПредупреждения = "Ни у одной из наших организаций не заполнена авторизация в Логистике";
			КонтурЛогистика_РаботаСЭлементамиФормыСервер.ВывестиПредупреждениеНастройкиАрхива(ЭтаФорма, ТекстПредупреждения);
			
		КонецЕсли;
		
	ИначеЕсли Объект.Ссылка = СтруктураПредопределенных.СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы Тогда
		
		Если (КонтурЛогистика_МетрикаПовтИсп.ВерсияБСП() = "0.0.0" Или КонтурЛогистика_МетрикаПовтИсп.ВерсияБСП() = Неопределено) 
			И Метаданные.Справочники.Найти("ХранилищеДополнительнойИнформации") = Неопределено Тогда
			
			ТекстПредупреждения = "В конфигурации отсутствует БСП или справочник ХранилищеДополнительнойИнформации. Используйте подключаемый модуль";
			КонтурЛогистика_РаботаСЭлементамиФормыСервер.ВывестиПредупреждениеНастройкиАрхива(ЭтаФорма, ТекстПредупреждения);
			
		КонецЕсли;
		
		ТочноеСовпадение = Ложь;
		ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(,, ТочноеСовпадение);
		Если Не ПараметрыСервиса.АвторизацияВыполнена Тогда
			
			ТекстПредупреждения = "Ни у одной из наших организаций не заполнена авторизация в Логистике";
			КонтурЛогистика_РаботаСЭлементамиФормыСервер.ВывестиПредупреждениеНастройкиАрхива(ЭтаФорма, ТекстПредупреждения);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьЭлементУправленияЗначениемБулево()
	
	Если Объект.ТипЗначения = "Булево" Тогда
		
		ЗначениеБулево = Объект.Значение;
		Элементы.Значение.Видимость = Ложь;
		Элементы.ГруппаТумблер.Видимость = Истина;
		
		Элементы.Вкл.Видимость = Объект.Значение = Истина;
		Элементы.Выкл.Видимость = Объект.Значение <> Истина;
		
		Если Объект.Значение = Истина Тогда 
			Элементы.Состояние.Заголовок = "Включено";
		Иначе
			Элементы.Состояние.Заголовок = "Отключено";
		КонецЕсли;
		
	Иначе
		
		Элементы.Значение.Видимость = Истина;
		Элементы.ГруппаТумблер.Видимость = Ложь;
		
	КонецЕсли;
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.Прочитать(); // объект мог быть изменен ПриСозданииНаСервере
	УстановитьЭлементУправленияЗначениемБулево();
	ОбновитьВидимостьГруппыТелеграм();
	
	Если Объект.Ссылка = СтруктураПредопределенных.КонтактыАдминистратора_АдресаЭлектронныхПочт Тогда
		
		ИспользоватьОтправкуНаПочту = НастройкиОтправкиПочтыЗаполнены();
		Если Не ИспользоватьОтправкуНаПочту Тогда
			Закрыть();
			Сообщить("Необходимо заполнить данные учетной записи электронной почты для отправки сообщений администратору");
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
				"ОбщаяФорма.КонтурЛогистика_НастройкаУчетнойЗаписиЭлектроннойПочты",, ЭтаФорма, ЭтаФорма,,,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	ИначеЕсли Объект.Ссылка = СтруктураПредопределенных.КонтактыАдминистратора_Телефоны
		И ЗначениеЗаполнено(Объект.Значение) Тогда
		
		ПроверитьРегистрациюТелефонаТелеграм();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкиОтправкиПочтыЗаполнены()
	
	Возврат КонтурЛогистика_РаботаСПочтовымиСообщениями.НастройкиОтправкиПочтыЗаполнены();
	
КонецФункции

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	
	УстановитьТипЗначенияЭлементаЗначения();

КонецПроцедуры

&НаСервере
Функция ПолучитьТипПМ()
	
	ПодключаемыйМодульТип = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ПодключаемыйМодульТип");
	
	Возврат ПодключаемыйМодульТип;
	
КонецФункции

&НаСервере
Процедура УстановитьТипЗначенияЭлементаЗначения()
	                    
	Если ЭтоПользовательскаяНастройка 
		ИЛИ (Объект.Наименование = "Путь до файла обработки epf" 
		И ПолучитьТипПМ() = Перечисления.КонтурЛогистика_ТипыПМ.ВСправочнике) Тогда 
		
		Если ЗначениеЗаполнено(Объект.ТипЗначения) Тогда	
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(Тип(Объект.ТипЗначения));
			ОписаниеТиповЗначения = Новый ОписаниеТипов(МассивТипов);
		Иначе
			ОписаниеТиповЗначения = Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная));
		КонецЕсли;
		
		Элемент = Элементы.Значение;
		Элемент.ОграничениеТипа = ОписаниеТиповЗначения;
		Элемент.ДоступныеТипы 	= ОписаниеТиповЗначения;
		Элемент.ВыбиратьТип 	= Ложь;		
		
		Объект.Значение 		= Элемент.ОграничениеТипа.ПривестиЗначение(Объект.Значение);
		
		Элементы.ТипЗначения.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.Описание.РедактированиеТекста = Истина;
		Элементы.Наименование.РедактированиеТекста = Истина;
				
	Иначе	
		
		ОписаниеТиповЗначения = Новый ОписаниеТипов(Объект.ТипЗначения);
		
		Элемент = Элементы.Значение;
		Элемент.ОграничениеТипа = ОписаниеТиповЗначения; 
		Элемент.ДоступныеТипы 	= ОписаниеТиповЗначения;
		Элемент.ВыбиратьТип 	= Ложь;
		
		Объект.Значение 		= Элемент.ОграничениеТипа.ПривестиЗначение(Объект.Значение);
		
		Элементы.ТипЗначения.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Описание.РедактированиеТекста = Ложь;
		Элементы.Наименование.РедактированиеТекста = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтоПользовательскаяНастройка Тогда
		
		СписокВыбора = МассивТиповЗначенийЭлементов("Справочники", "Перечисления", "ПримитивныеТипы");		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьИзСписка_КонтурЛогистика(СписокВыбора, , ЭтаФорма, "ТипЗначенияНачалоВыбораЗавершение");	
		
	ИначеЕсли Объект.Наименование = "Путь до файла обработки epf" И
		ПолучитьТипПМ() = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыПМ.ВСправочнике") Тогда
		
		СписокВыбора = МассивТиповЗначенийЭлементов("Справочники");		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьИзСписка_КонтурЛогистика(СписокВыбора, , ЭтаФорма, "ТипЗначенияНачалоВыбораЗавершение");	
		
	Иначе
		
		УстановитьТипЗначенияЭлементаЗначения();	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияНачалоВыбораЗавершение(ВыбранныйЭлемент, ТекДанные) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ТипЗначения = ВыбранныйЭлемент.Значение;
	УстановитьТипЗначенияЭлементаЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ВклНажатие(Элемент)
	
	Если Объект.ИмяПредопределенногоДляРасширения = "РазрешитьПодписьНаСервере"
		И КонтурЛогистика_ОбщегоНазначенияКлиентСервер.КонтурЛогистика_КакаяБаза() <> "Файловая"
		И ЕстьНастройкиССервернымСертификатом() Тогда
		
		// Проверим для клиент-серверной базы, что не осталось используемых сертификатов на сервере
		Сообщить("Не возможно отключить настройку, так как есть настройки подписания с серверным сертификатом.");
		Возврат;
	КонецЕсли;
	
	Если ТекПользовательПродвинутый Тогда 
		Объект.Значение = Не Объект.Значение;
		УстановитьЭлементУправленияЗначениемБулево();
		ВыполнитьДополнительныеДействия();
	Иначе 
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(
			"Менять настройки может пользователь с полными правами или ролью ""Настройка подсистемы""", "Нет доступа");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьНастройкиССервернымСертификатом()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаПодписания", ТекущаяДатаСеанса());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(КонтурЛогистика_НастройкиПодписанияСрезПоследних.СертификатНаСервере), ЛОЖЬ) КАК СертификатНаСервере
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_НастройкиПодписания.СрезПоследних(&ДатаПодписания, ) КАК КонтурЛогистика_НастройкиПодписанияСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.СертификатНаСервере;
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыклНажатие(Элемент)
	
	Если ТекПользовательПродвинутый Тогда 
		Объект.Значение = Не Объект.Значение;
		УстановитьЭлементУправленияЗначениемБулево();
		ВыполнитьДополнительныеДействия();
	Иначе 
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика(
			"Менять настройки может пользователь с полными правами или ролью ""Настройка подсистемы""", "Нет доступа");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Ссылка = СтруктураПредопределенных.ПодключаемыйМодульПуть Тогда 
		
		ПодключаемыйМодульТип = ПолучитьТипПМ();
		
		Если ЗначениеЗаполнено(ПодключаемыйМодульТип) И
			ПодключаемыйМодульТип = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыПМ.ВСправочнике") Тогда		
			
		Иначе	
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьФайл(
			"ОбработатьВыборФайлаПМ", 
			ЭтаФорма, 
			РежимДиалогаВыбораФайла.Открытие, 
			"Укажите подключаемый модуль (ПУТЬ с СЕРВЕРА 1С)", 
			, 
			"Внешняя обработка 1С8 (*.epf)|*.epf");
		КонецЕсли;
		
	ИначеЕсли Объект.Ссылка = СтруктураПредопределенных.КаталогСохраненияАрхиваДокументооборота Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьФайл(
			"ОбработатьВыборКаталогаАрхиваДокументооборота", 
			ЭтаФорма, 
			РежимДиалогаВыбораФайла.ВыборКаталога, 
			"Выберите каталог сохранения архива документооборота"); 
		
	ИначеЕсли Объект.Ссылка = СтруктураПредопределенных.КонтактыАдминистратора_Телефоны Тогда
		
		Если ЗначениеЗаполнено(Объект.Значение) Тогда
			ПроверитьРегистрациюТелефонаТелеграм();
		Иначе
			ОбновитьВидимостьГруппыТелеграм();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПриИзменении(Элемент)
	
	Если Объект.Ссылка = СтруктураПредопределенных.КонтактыАдминистратора_Телефоны Тогда
		
		Если ЗначениеЗаполнено(Объект.Значение) Тогда
			ПроверитьРегистрациюТелефонаТелеграм();
		Иначе
			ОбновитьВидимостьГруппыТелеграм();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайлаПМ(МассивВыбранныхФайлов, НеиспользуемыйПараметр = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(МассивВыбранныхФайлов) Тогда 
		Объект.Значение = МассивВыбранныхФайлов[0];
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если Объект.Ссылка = СтруктураПредопределенных.ПодключаемыйМодульПуть
		ИЛИ Объект.Ссылка = СтруктураПредопределенных.ПодключаемыйМодульТип
		Тогда
		
		Оповестить("ИзменениеПараметровПМ");
		
		ОбновитьПовторноИспользуемыеЗначения();
		
	ИначеЕсли Объект.Ссылка = СтруктураПредопределенных.ИспользуютсяМногиеКОдному И Объект.Значение Тогда
		
		Оповестить("КонтурЛогистика_ПоискОснованийКодНа1СПоУмолчанию");
				
	КонецЕсли;
	
	Оповестить("ИзменениеОбщейНастройки", Объект.ИмяПредопределенногоДляРасширения);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Если Объект.ИмяПредопределенногоДляРасширения = "АвтоматическоеПолучениеИОтправкаQRКодов" Тогда
		
		Попытка
			ВключитьВыключитьРегламентноеЗаданиеАвтоматическоеПолучениеИОтправкаQRКодов(Объект.Значение);
		Исключение
			
			Ошибка			= ИнформацияОбОшибке();
			ПодробнаяОшибка	= ПодробноеПредставлениеОшибки(Ошибка);
			
			Сообщить(ПодробнаяОшибка);
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВключитьВыключитьРегламентноеЗаданиеАвтоматическоеПолучениеИОтправкаQRКодов(НовоеПоложениеИспользования = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегЗаданиеАвтоматическоеПолучениеИОтправкаQRКодов = Метаданные.РегламентныеЗадания.Найти("КонтурЛогистика_АвтоматическоеПолучениеИОтправкаQRКодов");
	
	Если РегЗаданиеАвтоматическоеПолучениеИОтправкаQRКодов = Неопределено Тогда
		
		Если Метаданные.Справочники.Найти("ДополнительныеОтчетыИОбработки") = Неопределено Тогда
			Возврат Ложь;	
		КонецЕсли;
		
		ДопОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", КонтурЛогистика_РежимРасширенияСервер.ИмяОбработкиРегламентныхЗаданийДляРасширенияКонтурЛогистика());
		
		Если ЗначениеЗаполнено(ДопОбработка) Тогда
			
			ДопОбработкаОб = ДопОбработка.ПолучитьОбъект();
			
			Для каждого Команда Из ДопОбработкаОб.Команды Цикл
				
				Если Команда.Идентификатор = "КонтурЛогистика_АвтоматическоеПолучениеИОтправкаQRКодов"
					И Команда.ВариантЗапуска = Перечисления.СпособыВызоваДополнительныхОбработок.ВызовСерверногоМетода Тогда
					
					ЗаписатьОбработку = Ложь;
					
					Если НовоеПоложениеИспользования И Не ЗначениеЗаполнено(Команда.РегламентноеЗаданиеGUID) Тогда 
						
						ПараметрыЗадания = Новый Структура;
						ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ЗапускДополнительныхОбработок);
						ПараметрыЗадания.Вставить("Использование", Истина);
						НовоеРегламентное = КонтурЛогистика_РежимРасширенияСервер.ДобавитьРегламентноеЗадание(ПараметрыЗадания);	
						
						Команда.РегламентноеЗаданиеGUID = НовоеРегламентное.УникальныйИдентификатор;
						
						ЗаписатьОбработку = Истина;
						
					ИначеЕсли Не НовоеПоложениеИспользования И ЗначениеЗаполнено(Команда.РегламентноеЗаданиеGUID) Тогда
						
						Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Команда.РегламентноеЗаданиеGUID);
						Если Задание <> Неопределено Тогда
							Задание.Удалить();
						КонецЕсли;
						
						Команда.РегламентноеЗаданиеGUID = Неопределено;
						
						ЗаписатьОбработку = Истина;
						
					КонецЕсли;
					
					Если ЗаписатьОбработку Тогда
						ДопОбработкаОб.Записать();
					КонецЕсли;
														
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		текРЗ = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.КонтурЛогистика_АвтоматическоеПолучениеИОтправкаQRКодов);
	
		Если текРЗ = Неопределено Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Регламентное задание с таким идентификатором уже недоступно";
			Сообщение.Сообщить();
			Возврат Ложь;
			
		Иначе
			
			Если Не КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор() Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Управление заданиями доступно только для администратора";
				Сообщение.Сообщить();
				Возврат текРЗ.Использование;
				
			Иначе
				
				Если НовоеПоложениеИспользования = Неопределено Тогда 
					НовоеПоложениеИспользования = не текРЗ.Использование;
				КонецЕсли;
				
				текРЗ.Использование = НовоеПоложениеИспользования;
				текРЗ.Записать();
				Возврат текРЗ.Использование;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьДополнительныеДействия()

	Если Не Найти(Объект.ИмяПредопределенногоДляРасширения, "Автоконвертация_") = 0 
		И Объект.Значение = Истина Тогда // Автоконвертация_КонтурЛогистика_ПунктыМаршрута
		
		ТипСправочникаЛогистика = СтрЗаменить(Объект.ИмяПредопределенногоДляРасширения, "Автоконвертация_", "");
		
		Если Не НастрокаКонвертацииСправочникаСуществует(ТипСправочникаЛогистика) Тогда
		
			ПараметрыФормы = Новый Структура("ТипСправочникаЛогистика", ТипСправочникаЛогистика);
						
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
				"Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников.Форма.ФормаЭлемента", 
				ПараметрыФормы, 
				ЭтаФорма,,,, 
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
			
			КонецЕсли;
			
	ИначеЕсли Объект.ИмяПредопределенногоДляРасширения = "ИспользоватьТестовыйСерверДиадок" Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.УбратьПризнакНашПриСменеОкружения();
		
	ИначеЕсли Объект.ИмяПредопределенногоДляРасширения = "ИспользоватьОтправкуВТелеграм"
		И Объект.Значение = Истина Тогда
	
		КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика("Запустить проверку регистрации водителей в Телеграм?", РежимДиалогаВопрос.ДаНет, "Подтвердите обработку",, ЭтаФорма, "АктуализироватьСтатусыВодителейТелеграм");
	
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьСтатусыВодителейТелеграм(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Результат = КонтурЛогистика_ОбработкаДокументовСервер.АктуализироватьСтатусыВодителейТелеграм();
	
	Если Результат = Истина Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Статусы Телеграм водителей успешно актуализированы!");
		
	Иначе
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Не удалось актуализировать статусы Телеграм водителей по причине:" + Символы.ПС + СокрЛП(Результат));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастрокаКонвертацииСправочникаСуществует(ТипСправочникаЛогистика)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиКонвертацииСправочников.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников КАК НастройкиКонвертацииСправочников
	|ГДЕ
	|	НастройкиКонвертацииСправочников.ТипСправочникаЛогистика = &ТипСправочникаЛогистика
	|	И НЕ НастройкиКонвертацииСправочников.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ТипСправочникаЛогистика", ТипСправочникаЛогистика);
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции	

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если (ЗавершениеРаботы = Ложь Или ЗавершениеРаботы = Неопределено)
		И Не Объект.Ссылка.Пустая() Тогда 
		
		Оповестить("ОбновитьСтартовыйПомошник", Объект.Ссылка);
		Оповестить("ОбновитьРабочийСтол", Объект.Ссылка);
		Оповестить("КонтурЛогистика_ОбновитьФизическиеЛица");
		
		Если Объект.Ссылка = СтруктураПредопределенных.СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы Тогда
			
			ДатаГраницыПолученияПечатныхФормЭПД = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ДатаГраницыПолученияПечатныхФормЭПД");
			
			Если Объект.Значение И Не ЗначениеЗаполнено(ДатаГраницыПолученияПечатныхФормЭПД) Тогда		
				Оповестить("КонтурЛогистика_УстановитьДатуГраницыПолученияПечатныхФормЭПД");			
			КонецЕсли;
			
		ИначеЕсли Объект.Ссылка = СтруктураПредопределенных.СохранятьАрхивДокументооборотаВКаталог Тогда
			
			ДатаГраницыСохраненияАрхиваДокументооборота = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ДатаГраницыСохраненияАрхиваДокументооборота");
			КаталогСохраненияАрхиваДокументооборота = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("КаталогСохраненияАрхиваДокументооборота");
			
			Если Объект.Значение И Не ЗначениеЗаполнено(ДатаГраницыСохраненияАрхиваДокументооборота) Тогда		
				Оповестить("КонтурЛогистика_УстановитьДатуГраницыСохраненияАрхиваДокументооборота");
			ИначеЕсли Объект.Значение И Не ЗначениеЗаполнено(КаталогСохраненияАрхиваДокументооборота) Тогда
				Оповестить("КонтурЛогистика_УстановитьКаталогСохраненияАрхиваДокументооборота");
			КонецЕсли;
															
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция МассивТиповЗначенийЭлементов(Справочники = Неопределено, 
	
	Перечисления = Неопределено, ПримитивныеТипы = Неопределено)
	
	СписокВыбора = КонтурЛогистика_ОбщегоНазначенияСервер.МассивТиповЗначенийЭлементов(Справочники,	Перечисления, ПримитивныеТипы, "КонтурЛогистика_Настройки");	
	СписокВыбора.СортироватьПоЗначению();
	
	Возврат СписокВыбора;
	
КонецФункции

#КонецОбласти

#Область НастройкиАрхива

&НаКлиенте
Процедура ОбработатьВыборКаталогаАрхиваДокументооборота(Результат, НеиспользуемыйПараметр = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда 
		
		Объект.Значение = Результат[0];
		
		ПроверитьДоступКаталогаСохраненияАрхиваДокументооборота();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДоступКаталогаСохраненияАрхиваДокументооборота()
	
	Если Не ЗначениеЗаполнено(Объект.Значение) Тогда
		Сообщить("Выберите каталог");
		Возврат;
	КонецЕсли;
	
	ПроверитьДоступКаталогаСохраненияАрхиваДокументооборотаНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДоступКаталогаСохраненияАрхиваДокументооборотаНаСервере()
	
	Попытка
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ИмяФайла = Строка(Новый УникальныйИдентификатор) + ".txt";
		ИмяПромежуточногоФайла = СокрЛП(Объект.Значение) + "\" + ИмяФайла;
		ТекстовыйДокумент.Записать(ИмяПромежуточногоФайла);
		
		УдалитьФайлы(ИмяПромежуточногоФайла);
		
		Элементы.РезультатПроверкиДоступаКаталога.ЦветТекста = Новый Цвет(51, 153, 102); // зеленый
		Элементы.РезультатПроверкиДоступаКаталога.Заголовок = "Каталог доступен";
		
	Исключение
		
		Элементы.РезультатПроверкиДоступаКаталога.ЦветТекста = Новый Цвет(255, 0, 0); // красный
		Элементы.РезультатПроверкиДоступаКаталога.Заголовок = "Нет доступа";
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаНомераТелеграм

&НаКлиенте
Процедура ПроверитьРегистрациюТелефонаТелеграм()
	
	ИдетПроверкаТелефонаВТелеграм = Истина;
	ПодключитьОбработчикОжидания("ПроверитьРегистрациюТелефонаТелеграмВФоне", 0.1, Истина);
	ОбновитьВидимостьГруппыТелеграм();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРегистрациюТелефонаТелеграмВФоне()
	
	ТелефонЗарегестрированВТелеграм = ПроверитьРегистрациюТелеграмНаСервере(Объект.Значение);
	ИдетПроверкаТелефонаВТелеграм = Ложь;
	ОбновитьВидимостьГруппыТелеграм();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьРегистрациюТелеграмНаСервере(Телефон)
	
	Попытка
		ТелефонЗарегестрированВТелеграм = КонтурЛогистика_РаботаСТелеграм.ТелефонЗарегестрирован(Телефон);
	Исключение
		ТелефонЗарегестрированВТелеграм = Ложь;
	КонецПопытки;
	
	Возврат ТелефонЗарегестрированВТелеграм;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьВидимостьГруппыТелеграм()
	
	Если Объект.Ссылка = СтруктураПредопределенных.КонтактыАдминистратора_Телефоны Тогда
		Элементы.ГруппаПроверкаТелеграм.Видимость = Истина;
	Иначе
		Элементы.ГруппаПроверкаТелеграм.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ДекорацияИдетПроверкаТелеграм.Видимость = Ложь;
	Элементы.ДекорацияРезультатУспехТелеграм.Видимость = Ложь;
	Элементы.ДекорацияПодключитьТелеграм.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Значение) Тогда
		Элементы.ГруппаПроверкаТелеграм.Видимость = Истина;
		
		Если ИдетПроверкаТелефонаВТелеграм Тогда
			Элементы.ДекорацияИдетПроверкаТелеграм.Видимость = Истина;
		ИначеЕсли ТелефонЗарегестрированВТелеграм Тогда
			Элементы.ДекорацияРезультатУспехТелеграм.Видимость = Истина;
		Иначе
			Элементы.ДекорацияПодключитьТелеграм.Видимость = Истина;
		КонецЕсли;
	Иначе
		Элементы.ГруппаПроверкаТелеграм.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПодключитьТелеграмНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"ОбщаяФорма.КонтурЛогистика_QRКодБотаКаналаТелеграм",,
		ЭтаФорма, ЭтаФорма,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти
